-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-03-20 16:12:02
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `test_order`
--

-- --------------------------------------------------------

--
-- 資料表結構 `order`
--

CREATE TABLE `order` (
  `order_id` int(255) NOT NULL,
  `transaction_id` varchar(255) NOT NULL,
  `customer_id` int(50) DEFAULT NULL,
  `purchaser_name` varchar(50) DEFAULT NULL,
  `purchaser_mobile` varchar(50) DEFAULT NULL,
  `purchaser_email` varchar(50) DEFAULT NULL,
  `recipient_name` varchar(50) DEFAULT NULL,
  `recipient_mobile` varchar(50) DEFAULT NULL,
  `total_amount` int(50) NOT NULL,
  `payment_method` varchar(50) DEFAULT NULL,
  `shipping_method` varchar(50) DEFAULT NULL,
  `shipping_address` varchar(50) DEFAULT NULL,
  `invoice_type` varchar(50) DEFAULT NULL,
  `invoice_code` varchar(50) DEFAULT NULL,
  `company_title` varchar(50) DEFAULT NULL,
  `order_date` datetime DEFAULT NULL,
  `payment_status` varchar(50) DEFAULT NULL,
  `shipping_status` varchar(50) DEFAULT NULL,
  `shipping_date` datetime DEFAULT NULL,
  `order_status` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `order`
--

INSERT INTO `order` (`order_id`, `transaction_id`, `customer_id`, `purchaser_name`, `purchaser_mobile`, `purchaser_email`, `recipient_name`, `recipient_mobile`, `total_amount`, `payment_method`, `shipping_method`, `shipping_address`, `invoice_type`, `invoice_code`, `company_title`, `order_date`, `payment_status`, `shipping_status`, `shipping_date`, `order_status`) VALUES
(25, '20240311000000', 2, 'WWW', '0910123123', '123123@gmail.com', 'WWW', '0910123123', 2190, 'LINE PAY', '超取', '台南市中西區民族路二段212號', '二聯電子發票', '/ZDFGF45', 'NONE', '2024-03-13 19:03:55', '已付款', '已出貨', '2024-03-14 00:00:00', '處理中'),
(26, '20240313000001', NULL, '董柏翰', '0987654321', 'random1@example.com', 'doge', '0922453087', 30360, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-05-27 09:14:33', '已付款', '已出貨', '2024-03-20 00:00:00', '完成'),
(27, '20240313000002', NULL, '李詩涵', '0923456789', 'user2@mail.com', 'dog', '0960167219', 5700, 'ATM', '宅配', '台南市安南區大眾路360號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-09-18 16:27:51', '已付款', '已出貨', '2023-09-20 22:35:28', '完成'),
(28, '20240313000003', NULL, '蕭怡萱', '0978912345', 'test3@gmail.com', 'dog', '0907144351', 35952, 'LINE PAY', '宅配', '台南市中西區南門路二號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-11-04 11:03:22', '已付款', '已出貨', '2024-03-09 00:00:00', '完成'),
(29, '20240313000004', NULL, '郭家豪', '0967891234', 'info4@yahoo.com', 'dog', '0947033324', 10530, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-02-08 20:45:14', '已付款', '已出貨', '2023-02-19 05:12:33', '完成'),
(30, '20240313000005', NULL, '張宗翰', '0912876543', 'example5@outlook.com', 'dog', '0969768640', 66070, 'ATM', '宅配', ' 台北市信義區信義路五段7號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-07-15 14:59:28', '已付款', '已出貨', '2023-11-10 16:28:49', '完成'),
(31, '20240313000006', NULL, '彭佳穎', '0934567891', 'johndoe6@domain.com', 'dog', '0956789789', 12096, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-12-29 05:37:59', '已付款', '已出貨', '2023-12-31 09:47:21', '完成'),
(32, '20240313000007', NULL, '徐宜庭', '0912345678', 'jane7@example.org', 'dog', '0910111222', 11900, 'LINE PAY', '超取', '台南市仁德區大利路47號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-03-22 18:20:46', '已付款', '已出貨', '2023-06-04 19:55:14', '完成'),
(33, '20240313000008', NULL, '羅郁婷', '0945678912', 'randomuser8@mail.com', 'dog', '0912345678', 7995, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-08-11 10:55:37', '已付款', '已出貨', '2023-08-17 08:39:28', '完成'),
(34, '20240313000009', NULL, '張宏', '0956789123', 'testuser9@gmail.com', 'dog', '0998765432', 38270, '貨到付款', '超取', '台南市中西區永福路二段97巷', '二聯電子發票', '/DSF53F1', 'NONE', '2023-06-03 07:31:09', '已付款', '已出貨', '2023-06-14 11:26:59', '完成'),
(35, '20240313000010', NULL, '蕭雅婷', '0998765432', 'example10@yahoo.com', 'dog', '0956789123', 8208, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-10-09 23:08:40', '已付款', '已出貨', '2023-12-15 22:15:46', '完成'),
(36, '20240313000011', NULL, '沈雅筑', '0987654321', 'user1@example.com', 'dog', '0923456789', 38646, '貨到付款', '超取', '台南市北區林森路三段', '二聯電子發票', '/DSF53F1', 'NONE', '2023-07-29 15:42:09', '已付款', '已出貨', '2023-07-31 14:58:37', '完成'),
(37, '20240313000012', NULL, '曾怡萱', '0923456789', 'test2@mail.com', 'dog', '0945678912', 10005, 'LINE PAY', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-11-18 08:27:56', '已付款', '已出貨', '2023-11-21 17:32:09', '完成'),
(38, '20240313000013', NULL, '馮家豪', '0978912345', 'example3@gmail.com', 'dog', '0987654321', 58368, 'ATM', '宅配', '台南市中西區南門路2號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-08-03 19:13:28', '已付款', '已出貨', '2023-10-29 07:08:40', '完成'),
(39, '20240313000014', NULL, '蕭怡君', '0967891234', 'info4@yahoo.com', 'dog', '0978912345', 9126, 'ATM', '超取', '台北市中正區中正紀念堂', '二聯電子發票', '/DSF53F1', 'NONE', '2023-06-25 10:55:40', '已付款', '已出貨', '2023-06-28 13:24:17', '完成'),
(40, '20240313000015', NULL, '張彥廷', '0912876543', 'johndoe5@outlook.com', 'dog', '0934567891', 58140, 'LINE PAY', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-03-14 12:30:17', '已付款', '已出貨', '2023-03-25 18:06:50', '完成'),
(41, '20240313000016', NULL, '謝冠宇', '0934567891', 'jane6@domain.com', 'dog', '0967891234', 4550, '貨到付款', '超取', '台北市大同區迪化街一段', '二聯電子發票', '/DSF53F1', 'NONE', '2023-12-05 21:48:33', '已付款', '已出貨', '2023-12-09 03:33:44', '完成'),
(42, '20240313000017', NULL, '吳家瑋', '0912345678', 'randomuser7@example.org', 'dog', '0912876543', 22593, 'ATM', '宅配', '台南市中西區神農街58-1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-09-17 16:20:04', '已付款', '已出貨', '2023-09-20 20:49:08', '完成'),
(43, '20240313000018', NULL, '馮冠廷', '0945678912', 'testuser8@mail.com', 'dog', '0956234569', 9480, '貨到付款', '宅配', '台北市中山區北安路139號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-04-09 07:59:22', '已付款', '已出貨', '2023-06-16 09:37:55', '完成'),
(45, '20240313000020', NULL, '李四海', '0956789123', 'example9@gmail.com', 'dog', '0910123123', 22680, 'ATM', '宅配', '台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-10-21 13:47:55', '已付款', '已出貨', '2023-10-23 04:20:29', '完成'),
(88, '20240318000003', NULL, '蕭珍蕾', '0985666452', 'lay@gmail.com', '蕭珍蕾', '0985666452', 5472, '貨到付款', '超取', '新竹市香山區西濱公路5號', '二聯電子發票', '/XCS45FS', '', '2024-03-18 09:27:12', '未付款', '未出貨', '0000-00-00 00:00:00', '取消'),
(95, '20240318000053', NULL, 'cat', '0985666452', 'cat@gmail.com', 'cat', '0985666452', 3825, '貨到付款', '超取', '新竹市東區竹村七路13號', '二聯電子發票', 'cat', '', '2024-03-18 16:40:08', '未付款', '已出貨', '2024-03-19 10:06:04', '處理中'),
(96, '20240318000056', NULL, '王小明', '0924847854', 'stenson9903@gmail.com', '王小明', '0924847854', 2215, 'LINE PAY', '超取', '新竹市東區食品路66號300', '二聯電子發票', '/0JC4HWV', '', '2024-03-18 23:50:46', '未付款', '未出貨', '0000-00-00 00:00:00', '取消'),
(98, '20240318000060', NULL, '陳俠聰', '0989105347', 'garrix4297@outlook.com', '陳俠聰', '0989105347', 4401, '轉帳', '超取', '新竹縣竹北市頭前溪', '二聯電子發票', '/9ZLO8JO', '', '2024-03-18 23:52:09', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(100, '20240318000064', NULL, '王琪茹', '0937062696', 'alexandra2514@gmail.com', '王琪茹', '0937062696', 10775, '貨到付款', '宅配', ' 文化路南庄鄉苗栗縣353', '二聯電子發票', '/M4B0J75', '', '2024-03-18 23:53:53', '未付款', '未出貨', '0000-00-00 00:00:00', '取消'),
(101, '20240318000066', NULL, '林晟樸', '0953553707', 'taylor7630@outlook.com', '林晟樸', '0953553707', 19895, '轉帳', '中華郵政', '新竹市東區寶山路312號', '二聯電子發票', '/Z7RSCYS', '', '2024-03-18 23:54:36', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(102, '20240318000068', NULL, '林榮許', '0918834431', 'green9374@gmail.com', '林榮許', '0918834431', 4550, '轉帳', '宅配', '澎湖縣西嶼鄉10號', '二聯電子發票', '/AG1HW0N', '', '2024-03-18 23:55:22', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(104, '20240319000006', NULL, '李小龍', '0955566412', 'log@testmail.com', '李小龍', '0955566412', 6360, 'LINE PAY', '中華郵政', '連江縣南竿鄉復興村208號', '二聯電子發票', '/XCH65FS', '', '2024-03-19 14:11:14', '已付款', '已出貨', '2024-03-20 11:25:00', '處理中'),
(105, '20240319000008', NULL, '楊怡婷', '0918305860', 'mail59738@test.com', '楊怡婷', '0918305860', 18900, '轉帳', '中華郵政', '台東縣台東市鐵花路369號', '愛心捐贈', '56783', '', '2024-03-19 14:39:49', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(106, '20240319000010', NULL, '羅鈺婷', '0918391726', 'mail23439@test.com', '羅鈺婷', '0918391726', 2000, 'LINE PAY', '超取', '連江縣北竿鄉塘岐村中山路193號195號', '二聯電子發票', '/XCG95PQ', '', '2024-03-19 14:45:33', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(114, '20240320000002', NULL, '馬家瑋', '0918686130', 'mail50804@test.com', '馬家瑋', '0918686130', 6897, '信用卡', '超取', '台南市中西區中正路343-20號', '二聯電子發票', '/XCH65FS', '', '2024-03-20 11:04:27', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(115, '20240320000003', NULL, '馬宇軒', '0918441574', 'mail31458@test.com', '馬宇軒', '0918441574', 8010, 'LINE PAY', '超取', '台南市新市區南科三路10號', '二聯電子發票', '/XCS45FS', '', '2024-03-20 11:07:01', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(116, '20240320000004', NULL, '黃柏翰', '0918673337', 'mail53308@test.com', '黃柏翰', '0918673337', 18696, '轉帳', '超取', '基隆市中正區北寧路369巷61號', '二聯電子發票', '/XCS45FS', '', '2024-03-20 11:08:26', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(117, '20240320000006', NULL, '羅彥廷', '0918330482', 'mail95788@test.com', '羅彥廷', '0918330482', 9120, '轉帳', '宅配', '台北市大安區臨江街', '二聯電子發票', '/XCS45FS', '', '2024-03-20 13:36:03', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(118, '20240320000007', NULL, '孫郁婷', '0918267317', 'mail83145@test.com', '孫郁婷', '0918267317', 18240, '轉帳', '超取', '新竹市北區中山路75號', '二聯電子發票', '/XCS45FS', '', '2024-03-20 13:38:56', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中'),
(119, '20240320000008', NULL, '鄧冠霖	', '0918519592', 'mail42488@test.com', '鄧冠霖	', '0918519592', 5472, '信用卡', '超取', '新竹市東區食品路66號300', '二聯電子發票', '/XCS45FS', '', '2024-03-20 13:47:10', '已付款', '未出貨', '0000-00-00 00:00:00', '處理中');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`order_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order`
--
ALTER TABLE `order`
  MODIFY `order_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=127;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
