-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-03-20 15:04:35
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mydatabase`
--

-- --------------------------------------------------------

--
-- 資料表結構 `travel_`
--

CREATE TABLE `travel_` (
  `travel_id` int(11) NOT NULL,
  `logo` text NOT NULL COMMENT '圖片',
  `title` varchar(100) NOT NULL COMMENT '行程標題',
  `introduce` varchar(100) NOT NULL COMMENT '行程簡介',
  `days` int(11) NOT NULL COMMENT '天數',
  `price` int(11) NOT NULL COMMENT '售價',
  `time` date NOT NULL COMMENT '出發日期',
  `airport` varchar(10) NOT NULL COMMENT '出發地',
  `seat` int(11) NOT NULL COMMENT '機位數量',
  `number` int(11) NOT NULL COMMENT '已報名人數',
  `sale` int(11) NOT NULL COMMENT '可售機位',
  `sign_up` varchar(10) NOT NULL COMMENT '出團狀態',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '行程建立時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `travel_`
--

INSERT INTO `travel_` (`travel_id`, `logo`, `title`, `introduce`, `days`, `price`, `time`, `airport`, `seat`, `number`, `sale`, `sign_up`, `created_at`) VALUES
(1, '秘魯・印加帝國13日.jpg', '秘魯・印加帝國13日', '世界七大奇景馬丘比丘・印加都城庫斯科・魔幻打卡聖地彩虹山', 13, 272000, '2024-04-02', '桃園國際機場', 31, 31, 0, '額滿', '2024-03-18 08:24:23'),
(2, '秘魯・太陽祭14日.jpg', '秘魯・太陽祭14日', '2023年金旅獎！世界七大奇景馬丘比丘・印加都城庫斯科・傳統盛典太陽祭・魔幻打卡聖地彩虹山', 14, 299000, '2024-06-18', '桃園國際機場', 31, 26, 5, '報名中', '2024-03-18 08:24:23'),
(3, '秘魯・印加帝國15日.jpg', '秘魯・印加帝國15日', '星宇豪華經濟艙・世界七大奇景馬丘比丘・印加都城庫斯科・魔幻打卡聖地彩虹山', 15, 282000, '2024-11-15', '桃園國際機場', 31, 4, 27, '報名中', '2024-03-18 08:24:23'),
(4, '秘魯&智利・古文明探索13日.jpg', '秘魯&智利・古文明探索13日', '世界七大奇景馬丘比丘・印加都城庫斯科・神秘納斯卡線・與世隔絕復活節島', 13, 299000, '2024-03-30', '桃園國際機場', 21, 15, 6, '截止', '2024-03-18 08:24:23'),
(5, '秘魯&玻利維亞・秘境漫步14日.jpg', '秘魯&玻利維亞・秘境漫步14日', '季節限定！世界七大奇景馬丘比丘・魔幻打卡聖地彩虹山・天空之鏡烏尤尼・世界最高首都拉巴斯', 14, 309000, '2024-09-07', '桃園國際機場', 31, 12, 19, '報名中', '2024-03-18 08:24:23'),
(6, '阿根廷・14日.jpg', '阿根廷・14日', '世界遺產萬年冰川健行、世界最寬伊瓜蘇瀑布、世界盡頭火地島、南美巴黎布宜諾斯艾利斯', 14, 295000, '2024-09-12', '桃園國際機場', 31, 6, 25, '報名中', '2024-03-18 08:24:23'),
(7, '古巴・迷情之境12日.jpg', '古巴・迷情之境12日', '世界遺產哈瓦那老城．古董車．雪茄．蘭姆酒．海明威朝聖路線．切格瓦拉革命國度', 12, 225000, '2024-05-16', '桃園國際機場', 35, 35, 0, '額滿', '2024-03-18 08:24:23'),
(8, '古巴&墨西哥・亡靈節12日.jpg', '古巴&墨西哥・亡靈節12日', '華麗繽紛骷髏嘉年華！哈瓦那、古董車體驗、親捲雪茄、馬雅金字塔、馬雅金字塔、加勒比海豪華五星飯店', 12, 250000, '2024-10-12', '桃園國際機場', 20, 11, 9, '截止', '2024-03-18 08:24:23'),
(9, '奧地利&捷克・12日.jpg', '奧地利&捷克・12日', '慕夏走讀、季節音樂饗宴、夏夫堡火車、哈施達特、瓦豪河谷佳釀美饌、茜茜公主博物館', 12, 182900, '2024-12-17', '桃園國際機場', 26, 4, 22, '報名中', '2024-03-18 08:24:23'),
(10, '智利・15日.jpg', '智利・15日', '與世隔絕復活節島．藍湖仙境百內國家公園．世界最乾旱阿塔卡馬沙漠．智利酒莊道地佳釀', 15, 349000, '2025-03-08', '桃園國際機場', 36, 25, 11, '報名中', '2024-03-18 08:24:23'),
(11, '西班牙・13日.jpg', '西班牙・13日', '設計酒莊古堡美食宴饗', 13, 219900, '2024-05-18', '桃園國際機場', 26, 10, 16, '報名中', '2024-03-18 08:24:23'),
(12, '葡萄牙・12日.jpg', '葡萄牙・12日', '漫遊酒香葡萄牙、艷彩佩納古蹟饗宴', 12, 198900, '2024-04-24', '桃園國際機場', 27, 18, 9, '報名中', '2024-03-18 08:24:23'),
(13, '法國・深度全覽14日.jpg', '法國・深度全覽14日', '漫步走入南法生活美學、夜宿古堡朝暮晨昏', 14, 248900, '2024-09-18', '桃園國際機場', 27, 1, 26, '報名中', '2024-03-18 08:24:23'),
(14, '奧地利&捷克・12日.jpg', '奧地利&捷克・12日', '慕夏走讀、季節音樂饗宴、夏夫堡火車、哈施達特、瓦豪河谷佳釀美饌、茜茜公主博物館', 12, 185900, '2024-06-04', '桃園國際機場', 26, 3, 23, '報名中', '2024-03-18 08:24:23'),
(15, '日本登山鐵道之旅・7日.jpg', '探索日本登山鐵道・7日', '日本登山鐵道主題之旅', 7, 79900, '2024-05-19', '桃園國際機場', 27, 21, 6, '報名中', '2024-03-18 08:24:23'),
(16, '名古屋春櫻花見行５日.jpg', '名古屋春櫻花見行５日', '日本國寶犬山城.螃蟹燒肉餐.童話合掌村.粉紅隧道遊船.金澤兼六園.金華山纜車', 5, 42900, '2024-03-30', '桃園國際機場', 28, 28, 0, '額滿', '2024-03-18 08:24:23'),
(17, '花現櫻飛舞名古屋．京都６日.jpg', '花現櫻飛舞名古屋．京都６日', '粉紅隧道～哲學之道、花見醍醐寺、紅色鳥居、平等院鳳凰堂、宇治抹茶香、泡湯趣', 6, 36900, '2024-04-05', '桃園國際機場', 28, 19, 9, '報名中', '2024-03-18 08:24:23'),
(18, '關東悠遊全覽三溫泉螃蟹吃到飽５日.jpg', '關東悠遊全覽三溫泉螃蟹吃到飽５日', '澀谷露天展望台、採果體驗、輕井澤、伊豆箱根、鎌倉、權八日式居酒屋（加贈酒水暢飲）', 5, 56900, '2024-05-08', '桃園國際機場', 28, 16, 12, '報名中', '2024-03-18 08:24:23'),
(19, '星宇．名東雙城溫泉６日.jpg', '星宇．名東雙城溫泉６日', '歡樂迪士尼、掛川花鳥園、濱名湖花博、蘆之湖遊船、修善寺、日本平纜車', 6, 50900, '2024-04-05', '桃園國際機場', 25, 25, 0, '額滿', '2024-03-18 08:24:23'),
(20, '名東雙城立山黑部閃亮雪壁7日.jpg', '名東雙城立山黑部閃亮雪壁7日', '足利紫藤花、童話合掌村、日光東照宮、輕井澤OUTLET、國寶松本城、鬼怒川溫泉', 7, 59900, '2024-04-22', '桃園國際機場', 25, 23, 2, '報名中', '2024-03-18 08:24:23'),
(21, '琉球海炎祭-沖繩限定4日.jpg', '琉球海炎祭-沖繩限定4日', '夏季盛大音樂花火(自由席)、美麗海水族館、玉泉洞、單軌電車一日券、升等一晚海邊飯店', 4, 28900, '2024-04-12', '桃園國際機場', 16, 16, 0, '額滿', '2024-03-18 08:24:23'),
(22, '九州鯉躍春遊５日.jpg', '九州鯉躍春遊５日', '雙鐵道、雙遊船、日田小京都、春季限定鯉魚旗祭典、熊本熊甜點杯、米塚、草千里', 5, 32900, '2024-04-07', '桃園國際機場', 28, 28, 0, '額滿', '2024-03-18 08:24:23'),
(23, '名古屋立山黑部漫步大雪谷．濱名花博５天.jpg', '名古屋立山黑部漫步大雪谷．濱名花博５天', '神的故鄉~上高地．童話合掌村．馬籠宿．雙溫泉～升等一晚五星飯店', 5, 50900, '2024-06-09', '桃園國際機場', 27, 25, 2, '報名中', '2024-03-18 08:24:23'),
(24, '閃耀九州X浪漫銀光５日.jpg', '閃耀九州X浪漫銀光５日', '銀光閃耀之街、九州野生公園叢林巴士、由布院金鱗湖、世界童話村、三隈川屋形船晚宴、太宰府天滿宮', 5, 40900, '2024-05-09', '桃園國際機場', 27, 18, 9, '報名中', '2024-03-18 08:24:23'),
(25, '熊本X火山熊雙溫泉５日.jpg', '熊本X火山熊雙溫泉５日', '阿蘇破火山口、由布院金麟湖、別府海地獄、太宰府天滿宮、柳川遊船、熊本熊電鐵、地獄蒸DIY', 5, 38900, '2024-05-17', '桃園國際機場', 28, 10, 18, '報名中', '2024-03-18 08:24:23'),
(26, '秘魯・印加帝國13日.jpg', '秘魯・印加帝國13日', '世界七大奇景馬丘比丘・印加都城庫斯科・魔幻打卡聖地彩虹山', 13, 259000, '2025-02-17', '桃園國際機場', 31, 0, 31, '報名中', '2024-03-18 08:24:23'),
(27, '秘魯・印加帝國13日.jpg', '秘魯・印加帝國13日', '世界七大奇景馬丘比丘・印加都城庫斯科・魔幻打卡聖地彩虹山', 13, 269000, '2024-07-09', '桃園國際機場', 31, 11, 20, '報名中', '2024-03-18 08:24:23'),
(28, '秘魯・太陽祭14日.jpg', '秘魯・太陽祭14日', '2023年金旅獎！世界七大奇景馬丘比丘・印加都城庫斯科・傳統盛典太陽祭・魔幻打卡聖地彩虹山', 14, 299000, '2024-06-19', '桃園國際機場', 36, 36, 0, '額滿', '2024-03-18 08:24:23'),
(29, '阿根廷・14日.jpg', '阿根廷・14日', '世界遺產萬年冰川健行、世界最寬伊瓜蘇瀑布、世界盡頭火地島、南美巴黎布宜諾斯艾利斯', 14, 295000, '2024-07-12', '桃園國際機場', 31, 24, 7, '報名中', '2024-03-18 08:24:23'),
(30, '古巴・迷情之境12日.jpg', '古巴・迷情之境12日', '世界遺產哈瓦那老城．古董車．雪茄．蘭姆酒．海明威朝聖路線．切格瓦拉革命國度', 12, 229000, '2024-09-12', '桃園國際機場', 31, 10, 21, '報名中', '2024-03-18 08:24:23'),
(31, '古巴・迷情之境12日.jpg', '古巴・迷情之境12日', '世界遺產哈瓦那老城．古董車．雪茄．蘭姆酒．海明威朝聖路線．切格瓦拉革命國度', 12, 229000, '2025-01-22', '桃園國際機場', 31, 0, 31, '報名中', '2024-03-18 08:24:23'),
(32, '西班牙・13日.jpg', '西班牙・13日', '設計酒莊古堡美食宴饗', 13, 229900, '2024-07-18', '桃園國際機場', 26, 5, 21, '報名中', '2024-03-18 08:24:23'),
(33, '西班牙・13日.jpg', '西班牙・13日', '設計酒莊古堡美食宴饗', 13, 219900, '2024-09-12', '桃園國際機場', 26, 0, 26, '報名中', '2024-03-18 08:24:36'),
(34, '奧地利&捷克・12日.jpg', '奧地利&捷克・12日', '慕夏走讀、季節音樂饗宴、夏夫堡火車、哈施達特、瓦豪河谷佳釀美饌、茜茜公主博物館', 12, 189900, '2024-09-14', '桃園國際機場', 19, 19, 0, '額滿', '2024-03-18 08:24:36'),
(35, '法國・深度全覽14日.jpg', '法國・深度全覽14日', '漫步走入南法生活美學、夜宿古堡朝暮晨昏', 14, 248900, '2024-10-22', '桃園國際機場', 27, 0, 27, '報名中', '2024-03-18 08:24:36'),
(36, '日本登山鐵道之旅・7日.jpg', '探索日本登山鐵道・7日', '日本登山鐵道主題之旅', 7, 79900, '2024-05-09', '桃園國際機場', 27, 25, 2, '報名中', '2024-03-18 08:24:36'),
(37, '名古屋春櫻花見行５日.jpg', '名古屋春櫻花見行５日', '日本國寶犬山城.螃蟹燒肉餐.童話合掌村.粉紅隧道遊船.金澤兼六園.金華山纜車', 5, 42900, '2024-04-20', '桃園國際機場', 29, 29, 0, '額滿', '2024-03-18 08:24:36'),
(38, '花現櫻飛舞名古屋．京都６日.jpg', '花現櫻飛舞名古屋．京都６日', '粉紅隧道～哲學之道、花見醍醐寺、紅色鳥居、平等院鳳凰堂、宇治抹茶香、泡湯趣', 6, 36900, '2024-05-05', '桃園國際機場', 28, 22, 6, '報名中', '2024-03-18 08:24:36'),
(39, '關東悠遊全覽三溫泉螃蟹吃到飽５日.jpg', '關東悠遊全覽三溫泉螃蟹吃到飽５日', '澀谷露天展望台、採果體驗、輕井澤、伊豆箱根、鎌倉、權八日式居酒屋（加贈酒水暢飲）', 5, 56900, '2024-06-08', '桃園國際機場', 28, 11, 17, '報名中', '2024-03-18 08:24:36'),
(40, '星宇．名東雙城溫泉６日.jpg', '星宇．名東雙城溫泉６日', '歡樂迪士尼、掛川花鳥園、濱名湖花博、蘆之湖遊船、修善寺、日本平纜車', 6, 50900, '2024-04-25', '桃園國際機場', 25, 24, 1, '報名中', '2024-03-18 08:24:36'),
(41, '名東雙城立山黑部閃亮雪壁7日.jpg', '名東雙城立山黑部閃亮雪壁7日', '足利紫藤花、童話合掌村、日光東照宮、輕井澤OUTLET、國寶松本城、鬼怒川溫泉', 7, 59900, '2024-04-21', '桃園國際機場', 25, 25, 0, '額滿', '2024-03-18 08:24:36'),
(42, '琉球海炎祭-沖繩限定4日.jpg', '琉球海炎祭-沖繩限定4日', '夏季盛大音樂花火(自由席)、美麗海水族館、玉泉洞、單軌電車一日券、升等一晚海邊飯店', 4, 28900, '2024-04-19', '桃園國際機場', 18, 18, 0, '額滿', '2024-03-18 08:24:36'),
(43, '九州鯉躍春遊５日.jpg', '九州鯉躍春遊５日', '雙鐵道、雙遊船、日田小京都、春季限定鯉魚旗祭典、熊本熊甜點杯、米塚、草千里', 5, 32900, '2024-04-13', '桃園國際機場', 28, 27, 1, '報名中', '2024-03-18 08:24:36'),
(44, '名古屋立山黑部漫步大雪谷．濱名花博５天.jpg', '名古屋立山黑部漫步大雪谷．濱名花博５天', '神的故鄉~上高地．童話合掌村．馬籠宿．雙溫泉～升等一晚五星飯店', 5, 50900, '2024-06-10', '桃園國際機場', 27, 24, 3, '報名中', '2024-03-18 08:24:36'),
(45, '閃耀九州X浪漫銀光５日.jpg', '閃耀九州X浪漫銀光５日', '銀光閃耀之街、九州野生公園叢林巴士、由布院金鱗湖、世界童話村、三隈川屋形船晚宴、太宰府天滿宮', 5, 40900, '2024-05-13', '桃園國際機場', 27, 23, 4, '報名中', '2024-03-18 08:24:36'),
(46, '熊本X火山熊雙溫泉５日.jpg', '熊本X火山熊雙溫泉５日', '阿蘇破火山口、由布院金麟湖、別府海地獄、太宰府天滿宮、柳川遊船、熊本熊電鐵、地獄蒸DIY', 5, 38900, '2024-05-24', '桃園國際機場', 28, 21, 7, '報名中', '2024-03-18 08:24:36'),
(47, '智利・15日.jpg', '智利・15日', '與世隔絕復活節島．藍湖仙境百內國家公園．世界最乾旱阿塔卡馬沙漠．智利酒莊道地佳釀', 15, 349000, '2024-09-08', '桃園國際機場', 36, 33, 3, '報名中', '2024-03-18 08:24:36'),
(48, '秘魯&智利・古文明探索13日.jpg', '秘魯&智利・古文明探索13日', '世界七大奇景馬丘比丘・印加都城庫斯科・神秘納斯卡線・與世隔絕復活節島', 13, 299000, '2024-06-01', '桃園國際機場', 21, 10, 11, '報名中', '2024-03-18 08:24:36'),
(49, '葡萄牙・12日.jpg', '葡萄牙・12日', '漫遊酒香葡萄牙、艷彩佩納古蹟饗宴', 12, 198900, '2024-06-24', '桃園國際機場', 27, 10, 17, '報名中', '2024-03-18 08:24:36'),
(50, '秘魯&玻利維亞・秘境漫步14日.jpg', '秘魯&玻利維亞・秘境漫步14日', '天空之鏡烏尤尼．與世隔絕復活節島．世界最乾旱阿塔卡馬沙漠．世界最高首都拉巴斯', 14, 325000, '2024-11-11', '桃園國際機場', 31, 2, 29, '報名中', '2024-03-18 08:24:36');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `travel_`
--
ALTER TABLE `travel_`
  ADD PRIMARY KEY (`travel_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `travel_`
--
ALTER TABLE `travel_`
  MODIFY `travel_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
